In [1]:
import pandas as pd
import numpy as np

In [2]:
array1 = np.arange(500).reshape(50,10)

In [3]:
df = pd.DataFrame(array1)

## Apply Functions

**Apply** applies a function along any axis of the DataFrame. It can also be applied for Series.

In [4]:
series_obj = df[9]
series_obj

0       9
1      19
2      29
3      39
4      49
5      59
6      69
7      79
8      89
9      99
10    109
11    119
12    129
13    139
14    149
15    159
16    169
17    179
18    189
19    199
20    209
21    219
22    229
23    239
24    249
25    259
26    269
27    279
28    289
29    299
30    309
31    319
32    329
33    339
34    349
35    359
36    369
37    379
38    389
39    399
40    409
41    419
42    429
43    439
44    449
45    459
46    469
47    479
48    489
49    499
Name: 9, dtype: int64

In [5]:
series_obj.dtype

dtype('int64')

In [6]:
type(series_obj)

pandas.core.series.Series

In [7]:
df.apply(sum, axis=1) # Added all the columns of specific row

0       45
1      145
2      245
3      345
4      445
5      545
6      645
7      745
8      845
9      945
10    1045
11    1145
12    1245
13    1345
14    1445
15    1545
16    1645
17    1745
18    1845
19    1945
20    2045
21    2145
22    2245
23    2345
24    2445
25    2545
26    2645
27    2745
28    2845
29    2945
30    3045
31    3145
32    3245
33    3345
34    3445
35    3545
36    3645
37    3745
38    3845
39    3945
40    4045
41    4145
42    4245
43    4345
44    4445
45    4545
46    4645
47    4745
48    4845
49    4945
dtype: int64

In [9]:
sample_df = pd.DataFrame(series_obj)
sample_df

      9
0     9
1    19
2    29
3    39
4    49
5    59
6    69
7    79
8    89
9    99
10  109
11  119
12  129
13  139
14  149
15  159
16  169
17  179
18  189
19  199
20  209
21  219
22  229
23  239
24  249
25  259
26  269
27  279
28  289
29  299
30  309
31  319
32  329
33  339
34  349
35  359
36  369
37  379
38  389
39  399
40  409
41  419
42  429
43  439
44  449
45  459
46  469
47  479
48  489
49  499

In [10]:
dict1 = {chr(97 + i):10 * (i+1) for i in range(10)}
dict1

{'a': 10,
 'b': 20,
 'c': 30,
 'd': 40,
 'e': 50,
 'f': 60,
 'g': 70,
 'h': 80,
 'i': 90,
 'j': 100}

In [13]:
cities_in_f = {'New York': 32, 'Boston': 75, 'Los Angeles': 100, 'Chicago': 50}

In [14]:
cities_in_c = { key: round((value -32) * (5/9)) for (key, value) in cities_in_f.items()}
print(cities_in_c)

{'New York': 0, 'Boston': 24, 'Los Angeles': 38, 'Chicago': 10}

In [15]:
cities_in_c = {key: value for (key, value) in cities_in_f.items() if value >= 50}
cities_in_c

{'Boston': 75, 'Los Angeles': 100, 'Chicago': 50}

In [16]:
cities_in_f = {'New York': 32, 'Boston': 75, 'Los Angeles': 100, 'Chicago': 50}

desc_cities = {key:("Warm" if value >= 40 else "Cold") for (key, value) in cities_in_f.items()}
desc_cities

{'New York': 'Cold',
 'Boston': 'Warm',
 'Los Angeles': 'Warm',
 'Chicago': 'Warm'}

In [17]:
a = {'a':10, 'b':21, 'c':30, 'd':41}

even_odd = {key:("Even" if value % 2 == 0 else "Odd") for (key, value) in a.items()}
even_odd

{'a': 'Even', 'b': 'Odd', 'c': 'Even', 'd': 'Odd'}

In [18]:
a = {'a':10, 'b':21, 'c':30, 'd':41}

def even_odd_finder(value):
    return "Even" if value % 2 == 0 else "Odd"

In [19]:
even_odd_classified = {key: even_odd_finder(value) for (key, value) in a.items()}
even_odd_classified

{'a': 'Even', 'b': 'Odd', 'c': 'Even', 'd': 'Odd'}

## Examples:

In [20]:
df = pd.read_csv("coffee_shop_revenue.csv")

In [21]:
df

,Number_of_Customers_Per_Day,Average_Order_Value,Operating_Hours_Per_Day,Number_of_Employees,Marketing_Spend_Per_Day,Location_Foot_Traffic,Daily_Revenue
0,152,6.74,14,4,106.62,97,1547.81
1,485,4.50,12,8,57.83,744,2084.68
2,398,9.09,6,6,91.76,636,3118.39
3,320,8.48,17,4,462.63,770,2912.20
4,156,7.44,17,2,412.52,232,1663.42
...,...,...,...,...,...,...,...
1995,372,6.41,11,4,466.11,913,2816.85
1996,105,3.01,11,7,12.62,235,337.97
1997,89,5.28,16,9,376.64,310,951.34
1998,403,9.41,7,12,452.49,577,4266.21
1999,89,6.88,13,14,78.46,322,914.24

In [22]:
df.describe()

,Number_of_Customers_Per_Day,Average_Order_Value,Operating_Hours_Per_Day,Number_of_Employees,Marketing_Spend_Per_Day,Location_Foot_Traffic,Daily_Revenue
count,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000
mean,274.296000,6.261215,11.667000,7.947000,252.614160,534.893500,1917.325940
std,129.441933,2.175832,3.438608,3.742218,141.136004,271.662295,976.202746
min,50.000000,2.500000,6.000000,2.000000,10.120000,50.000000,-58.950000
25%,164.000000,4.410000,9.000000,5.000000,130.125000,302.000000,1140.085000
50%,275.000000,6.300000,12.000000,8.000000,250.995000,540.000000,1770.775000
75%,386.000000,8.120000,15.000000,11.000000,375.352500,767.000000,2530.455000
max,499.000000,10.000000,17.000000,14.000000,499.740000,999.000000,5114.600000

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Number_of_Customers_Per_Day  2000 non-null   int64
 1   Average_Order_Value          2000 non-null   float64
 2   Operating_Hours_Per_Day      2000 non-null   int64
 3   Number_of_Employees          2000 non-null   int64
 4   Marketing_Spend_Per_Day      2000 non-null   float64
 5   Location_Foot_Traffic        2000 non-null   int64
 6   Daily_Revenue                2000 non-null   float64
dtypes: float64(3), int64(4)
memory usage: 109.5 KB

In [24]:
len(np.unique(df['Number_of_Customers_Per_Day']))

441

In [25]:
len(pd.unique(df['Number_of_Customers_Per_Day']))

441

In [26]:
df.dtypes

Number_of_Customers_Per_Day      int64
Average_Order_Value            float64
Operating_Hours_Per_Day          int64
Number_of_Employees              int64
Marketing_Spend_Per_Day        float64
Location_Foot_Traffic            int64
Daily_Revenue                  float64
dtype: object

In [27]:
df['Location_Foot_Traffic'].dtype

dtype('int64')

In [28]:
# Extracting total unique values for each column category

unique_values = {column: len(pd.unique(df[column])) for column in df.columns}
unique_values

{'Number_of_Customers_Per_Day': 441,
 'Average_Order_Value': 694,
 'Operating_Hours_Per_Day': 12,
 'Number_of_Employees': 13,
 'Marketing_Spend_Per_Day': 1967,
 'Location_Foot_Traffic': 831,
 'Daily_Revenue': 1998}

In [29]:
unique_values_list = [len(pd.unique(df[column])) for column in df.columns]
unique_values_list

[441, 694, 12, 13, 1967, 831, 1998]

In [30]:
for col in df.columns:
    print(f'{col} = {len(np.unique(df[col]))}')

Number_of_Customers_Per_Day = 441
Average_Order_Value = 694
Operating_Hours_Per_Day = 12
Number_of_Employees = 13
Marketing_Spend_Per_Day = 1967
Location_Foot_Traffic = 831
Daily_Revenue = 1998

In [31]:
for col in df.columns:
    print(f'{col} = {len(pd.unique(df[col]))}')

Number_of_Customers_Per_Day = 441
Average_Order_Value = 694
Operating_Hours_Per_Day = 12
Number_of_Employees = 13
Marketing_Spend_Per_Day = 1967
Location_Foot_Traffic = 831
Daily_Revenue = 1998

## Pivot tables:

In [32]:
df.head()

,Number_of_Customers_Per_Day,Average_Order_Value,Operating_Hours_Per_Day,Number_of_Employees,Marketing_Spend_Per_Day,Location_Foot_Traffic,Daily_Revenue
0,152,6.74,14,4,106.62,97,1547.81
1,485,4.50,12,8,57.83,744,2084.68
2,398,9.09,6,6,91.76,636,3118.39
3,320,8.48,17,4,462.63,770,2912.20
4,156,7.44,17,2,412.52,232,1663.42

In [36]:
df.describe()

,Number_of_Customers_Per_Day,Average_Order_Value,Operating_Hours_Per_Day,Number_of_Employees,Marketing_Spend_Per_Day,Location_Foot_Traffic,Daily_Revenue
count,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000
mean,274.296000,6.261215,11.667000,7.947000,252.614160,534.893500,1917.325940
std,129.441933,2.175832,3.438608,3.742218,141.136004,271.662295,976.202746
min,50.000000,2.500000,6.000000,2.000000,10.120000,50.000000,-58.950000
25%,164.000000,4.410000,9.000000,5.000000,130.125000,302.000000,1140.085000
50%,275.000000,6.300000,12.000000,8.000000,250.995000,540.000000,1770.775000
75%,386.000000,8.120000,15.000000,11.000000,375.352500,767.000000,2530.455000
max,499.000000,10.000000,17.000000,14.000000,499.740000,999.000000,5114.600000

In [33]:
df.columns

Index(['Number_of_Customers_Per_Day', 'Average_Order_Value',
       'Operating_Hours_Per_Day', 'Number_of_Employees',
       'Marketing_Spend_Per_Day', 'Location_Foot_Traffic', 'Daily_Revenue'],
      dtype='object')

## How many unique values are there in location foot Traffic?

In [41]:
len(pd.unique(df['Location_Foot_Traffic']))

831

## What are the average Revenue_Per_Day	 for specific Location_Foot_Traffic	?

In [54]:
avg_revenue_per_operating_hours = pd.pivot_table(
    df,
    index='Operating_Hours_Per_Day',
    values='Daily_Revenue',
    aggfunc='mean'
 
).reset_index()

In [59]:
avg_revenue_per_operating_hours.columns = ['Categorized_Shops_per_Operating_Hours_per_Day', "Mean_Daily_Revenue"]
avg_revenue_per_operating_hours.head()

   Categorized_Shops_per_Operating_Hours_per_Day  Mean_Daily_Revenue
0                                              6         1924.378710
1                                              7         1929.301486
2                                              8         1847.814037
3                                              9         2018.685901
4                                             10         1854.766242